docs/system_design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-15 Wed 11:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>System Design</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">System Design</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd911dc0">1. Basics</a></li>
<li><a href="#org2d5c278">2. Terminologies</a>
<ul>
<li><a href="#org56a4e67">2.1. Replication</a></li>
<li><a href="#orgacd1606">2.2. Consistency</a></li>
<li><a href="#orgad7b6c5">2.3. Availability</a></li>
<li><a href="#org9bcdc21">2.4. Partition Tolerance</a></li>
<li><a href="#org27c4a6b">2.5. Vertical scaling and Horizontal scaling</a></li>
<li><a href="#orgfe89264">2.6. Sharding</a></li>
</ul>
</li>
<li><a href="#orgbfe2e8b">3. CAP Theorem</a></li>
<li><a href="#orgc4b2956">4. Approaching System Design Questions</a></li>
<li><a href="#orgf717c4f">5. Caching</a>
<ul>
<li><a href="#org834dc95">5.1. Types</a></li>
<li><a href="#orgcc2fe35">5.2. Implementing LRU caching</a></li>
</ul>
</li>
<li><a href="#org08fcd8e">6. SAS/SSD</a></li>
<li><a href="#org161294b">7. Implementing TinyURL</a>
<ul>
<li><a href="#org3cc9265">7.1. Feature Clarification</a></li>
<li><a href="#org3d7d434">7.2. Data Estimation</a></li>
<li><a href="#org0d606a2">7.3. Design Goals</a></li>
<li><a href="#orga445f03">7.4. Design API</a>
<ul>
<li><a href="#orgf147852">7.4.1. Computing the Hash</a></li>
<li><a href="#org96ef9d4">7.4.2. Stateless application servers</a></li>
<li><a href="#org30bcb51">7.4.3. </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org273c5d3">8. Implementing Search</a></li>
<li><a href="#org6b802b3">9. Implementing a distributed key-store</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd911dc0" class="outline-2">
<h2 id="orgd911dc0"><span class="section-number-2">1</span> Basics</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>SQL, noSQL</li>
<li>Concurrency
<ul class="org-ul">
<li>Threads, deadlock, starvation</li>
<li>read/write locks</li>
</ul></li>
<li>Networking
<ul class="org-ul">
<li>Routers/Switches</li>
<li>TCP vs UDP</li>
</ul></li>
<li>File Systems
<ul class="org-ul">
<li>OS, file system, database</li>
<li>levels of caching in modern OS</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org2d5c278" class="outline-2">
<h2 id="org2d5c278"><span class="section-number-2">2</span> Terminologies</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org56a4e67" class="outline-3">
<h3 id="org56a4e67"><span class="section-number-3">2.1</span> Replication</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Replication refers to frequently copying the data across multiple
machines. Post replication, multiple copies of the data exists across
machines. This might help in case one or more of the machines die due
to some failure.
</p>
</div>
</div>

<div id="outline-container-orgacd1606" class="outline-3">
<h3 id="orgacd1606"><span class="section-number-3">2.2</span> Consistency</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Assuming you have a storage system which has more than one machine,
consistency implies that the data is same across the cluster, so you
can read or write to/from any node and get the same data. Eventual
consistency : Exactly what the name suggests. In a cluster, if
multiple machines store the same data, an eventual consistent model
implies that all machines will have the same data eventually. Its
possible that at a given instance, those machines have different
versions of the same data ( temporarily inconsistent ) but they will
eventually reach a state where they have the same data.
</p>
</div>
</div>

<div id="outline-container-orgad7b6c5" class="outline-3">
<h3 id="orgad7b6c5"><span class="section-number-3">2.3</span> Availability</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In the context of a database cluster, Availability refers to the
ability to always respond to queries ( read or write ) irrespective of
nodes going down.
</p>
</div>
</div>

<div id="outline-container-org9bcdc21" class="outline-3">
<h3 id="org9bcdc21"><span class="section-number-3">2.4</span> Partition Tolerance</h3>
<div class="outline-text-3" id="text-2-4">
<p>
In the context of a database cluster, cluster continues to function
even if there is a “partition” (communications break) between two
nodes (both nodes are up, but can’t communicate).
</p>
</div>
</div>

<div id="outline-container-org27c4a6b" class="outline-3">
<h3 id="org27c4a6b"><span class="section-number-3">2.5</span> Vertical scaling and Horizontal scaling</h3>
<div class="outline-text-3" id="text-2-5">
<p>
In simple terms, to scale horizontally is adding more servers. To scale
vertically is to increase the resources of the server ( RAM, CPU,
storage, etc. ). Example: Lets say you own a restaurant which is now
exceeding its seating capacity. One way of accomodating more people (
scaling ) would be to add more and more chairs (scaling vertically).
However since the space is limited, you won’t be able to add more
chairs once the space is full. Another way of scaling would be to open
new branches of the restaurant ( horizontal scaling ). Source :
<a href="http://stackoverflow.com/questions/5401992/what-does-scale-horizontally-and-scale-vertically-mean">http://stackoverflow.com/questions/5401992/what-does-scale-horizontally-and-scale-vertically-mean</a>
</p>
</div>
</div>

<div id="outline-container-orgfe89264" class="outline-3">
<h3 id="orgfe89264"><span class="section-number-3">2.6</span> Sharding</h3>
<div class="outline-text-3" id="text-2-6">
<p>
With most huge systems, data does not fit on a single machine. In such
cases, sharding refers to splitting the very large database into
smaller, faster and more manageable parts called data shards.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbfe2e8b" class="outline-2">
<h2 id="orgbfe2e8b"><span class="section-number-2">3</span> CAP Theorem</h2>
<div class="outline-text-2" id="text-3">
<p>
It is impossible to simultaneously guarantee the following:
</p>
<ol class="org-ol">
<li>Consistency</li>
<li>Availability</li>
<li>Partition Tolerance</li>
</ol>
</div>
</div>

<div id="outline-container-orgc4b2956" class="outline-2">
<h2 id="orgc4b2956"><span class="section-number-2">4</span> Approaching System Design Questions</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Feature Clarification (2 minutes)</li>
<li>Estimations
<ol class="org-ol">
<li>Does the data fit in one machine/database?</li>
<li>Can the cache fit on one machine/database?</li>
</ol></li>
<li>Design Goals
<ol class="org-ol">
<li>Can data loss be tolerated?</li>
</ol></li>
<li>Skeleton of design
<ol class="org-ol">
<li>Discuss high-level components; go into deep dive only on request</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-orgf717c4f" class="outline-2">
<h2 id="orgf717c4f"><span class="section-number-2">5</span> Caching</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org834dc95" class="outline-3">
<h3 id="org834dc95"><span class="section-number-3">5.1</span> Types</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Write-through -  write to both cache and db at the same time,
before confirming write completion
<ul class="org-ul">
<li>Write latency is higher</li>
<li>but re-reading writes and reads is fast</li>
</ul></li>
<li>Write-around - write to db, missing cache
<ul class="org-ul">
<li>cache must fetch reads from db on first try</li>
<li>higher read latency</li>
</ul></li>
<li>Write-back - I/O completion sent when data written to cache
<ul class="org-ul">
<li>cache writes to db</li>
<li>might lose data</li>
<li>allieviated with replicates</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgcc2fe35" class="outline-3">
<h3 id="orgcc2fe35"><span class="section-number-3">5.2</span> Implementing LRU caching</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Hashtable + Doubly-linked list
Key -&gt; Pointer to node in doubly linked list
Each time it is accessed, move node to head of doubly-linked list
Evicting keys:
If adding new item, and it is full, remove tail of list, 
</p>
</div>
</div>
</div>
<div id="outline-container-org08fcd8e" class="outline-2">
<h2 id="org08fcd8e"><span class="section-number-2">6</span> SAS/SSD</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>used for I/O over SATA (7.5krpm)</li>
</ol>
</div>
</div>
<div id="outline-container-org161294b" class="outline-2">
<h2 id="org161294b"><span class="section-number-2">7</span> Implementing TinyURL</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org3cc9265" class="outline-3">
<h3 id="org3cc9265"><span class="section-number-3">7.1</span> Feature Clarification</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>Shorten a URL</li>
<li>Expand a slug into a URL</li>
<li>Allow users to pick a custom URL</li>
</ol>
</div>
</div>
<div id="outline-container-org3d7d434" class="outline-3">
<h3 id="org3d7d434"><span class="section-number-3">7.2</span> Data Estimation</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>Assume tinyURL load, 100M new writes per month</li>
<li>Then, in 5 years, 6B writes.</li>
<li>To handle 6B slugs, assuming we're using [A-z][a-z][0-9] 62<sup>k</sup> &gt; 6*10<sup>9</sup></li>
<li>slugs need just 6 characters, 6 bytes.
<ol class="org-ol">
<li>Slugs will take up 36GB.</li>
</ol></li>
<li>Assume 500 bytes for a URL, URLs will take up 3TB.
<ol class="org-ol">
<li>It is reasonable to store all of this on a single machine.</li>
<li>But large amounts of reads and writes going to one machine can
cause deadlock</li>
<li>Master-slave replication</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org0d606a2" class="outline-3">
<h3 id="org0d606a2"><span class="section-number-3">7.3</span> Design Goals</h3>
<div class="outline-text-3" id="text-7-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Latency</th>
<th scope="col" class="org-left">Consistency</th>
<th scope="col" class="org-left">Availability</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">C &gt; A</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga445f03" class="outline-3">
<h3 id="orga445f03"><span class="section-number-3">7.4</span> Design API</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>shortenURL(url)</li>
<li>expandURL(hash)</li>
</ul>
</div>
<div id="outline-container-orgf147852" class="outline-4">
<h4 id="orgf147852"><span class="section-number-4">7.4.1</span> Computing the Hash</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
convert<sub>to</sub><sub>base</sub><sub>62</sub>(md5(url + salt))[:6]
</p>
</div>
</div>
<div id="outline-container-org96ef9d4" class="outline-4">
<h4 id="org96ef9d4"><span class="section-number-4">7.4.2</span> Stateless application servers</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
load balancers ensure application is available when a server dies, and
client knows which server to talk to
</p>
</div>
</div>
<div id="outline-container-org30bcb51" class="outline-4">
<h4 id="org30bcb51"><span class="section-number-4">7.4.3</span> </h4>
</div>
</div>
</div>

<div id="outline-container-org273c5d3" class="outline-2">
<h2 id="org273c5d3"><span class="section-number-2">8</span> Implementing Search</h2>
</div>
<div id="outline-container-org6b802b3" class="outline-2">
<h2 id="org6b802b3"><span class="section-number-2">9</span> Implementing a distributed key-store</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>Data can't fit onto one machine</li>
<li>So now the choice is between consistency and availability</li>
<li>Perform some estimations
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-15 Wed 11:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
